app/controllers/event_pages_controller.rb

  def show
    @event = Event.find_by_subdomain(current_subdomain, :conditions => "published = true")
    @event_pages = @event.owned_event_pages.find(:all, :conditions => "published = true")
---
SELECT * FROM `events` WHERE (`events`.`subdomain` = 'test') LIMIT 1
SELECT * FROM `event_pages` WHERE (`event_pages`.`id` = 298486374)