app/controllers/events_controller.rb

  def show
    if current_subdomain.blank?
      @event = get_owned_event
    else
      @event = Event.find_by_subdomain(current_subdomain, :conditions => "published = true")
      if @event.blank?
        render_404
      else
        @event_pages = @event.owned_event_pages.find(:all, :conditions => "published = true")
---
SELECT * FROM `events` WHERE (`events`.`id` = 298486374)