app/controllers/users_controller.rb

INSERT INTO `users` (`encrypted_password`, `salt`, `created_at`, `updated_at`, `token`, `token_expires_at`, `remember_token`, `confirmation_token`, `email_confirmed`, `email`) VALUES('118e7cd220cbd5a9a5b27f76d732a40500e4e866', '46ffe32972d7449cd604135c8526fa5ecae114e0', '2010-08-10 13:32:31', '2010-08-10 13:32:31', '969a3e8d39e9eb211f2f07856fa814bdd6987ac2', NULL, NULL, NULL, 0, 'email@person.com')
---
  def create
    @user = ::User.new params[:user]
    @user.superadmin = false
    invite_code = params[:invite_code]
    @invite = Invite.find_redeemable(invite_code)
    if invite_code && @invite
      if @user.save